janitz/uhrDesSandes/ub_lib/stm32_ub_ws2812_8ch.c
//--------------------------------------------------------------
// File     : stm32_ub_ws2812_8ch.c
// Datum    : 04.10.2014
// Version  : 1.0
// Autor    : UB
// EMail    : mc-4u(@)t-online.de
// Web      : www.mikrocontroller-4u.de
// CPU      : STM32F4
// IDE      : CooCox CoIDE 1.7.4
// GCC      : 4.7 2012q4
// Module   : GPIO, TIM, DMA, MISC, EXTI, SYSCFG
// Funktion : RGB-LED mit WS2812-Chip (LED Vcc = 3,3V !!)
//            (einzelne LED oder bis zu 8 Ketten von n-LEDs)
//
// Hinweis  : es koennen bis zu 8 LED-Ketten betrieben werden
//            die benutzten GPIO-Pins muessen im H-File eingestellt werden
//            die max Anzahl der LEDs muss auch im H-File eingestellt werden
//
// CH1 = PC6
// CH2 = PB5
// CH3 = PB0
// CH4 = PB1
// CH5 = PE9
// CH6 = PE11
// CH7 = PE13
// CH8 = PE14
//
// EXTI = PD0 (zum messen der Anzahl der LEDs aller WS2812-Ketten)
//
// Hinweis : der Ausgang der letzten LED von allen Ketten muss
//           ueber je eine Diode (BAT46) zum EXTI-Pin geleitet werden
//            WS2812_OUT -> Anode -> Kathode -> EXTI
//  (bei Fehler in Laengenmessung wird "WS2812_LED_MAX_ANZ" benutzt)
//
// Rechnungen   : LEDs pro Kanal = n  ,  Anzahl Kanaele = c
// RAM [Bytes]  : (3*n*c)+(2*((n+2)*24))
// Refresh [us] : c*((n*30)+60)
// Beispiel     : 100 Leds pro Kanal, 8 Kanaele = 7kByte, 24ms
//--------------------------------------------------------------


//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32_ub_ws2812_8ch.h"


//--------------------------------------------------------------
// Globale interne Variabeln
//--------------------------------------------------------------
uint32_t ws2812_dma_status;
uint16_t WS2812_TIMER_BUF[WS2812_TIMER_BUF_LEN];
uint8_t  ws2812_aktiv_channel;
WS2812_RGB_t *ws2812_ptr;
uint32_t ws2812_maxanz;
uint32_t ws2812_len;
uint8_t  ws2812_ch_changed;


//--------------------------------------------------------------
// interne Funktionen
//--------------------------------------------------------------
void p_WS2812_setChannel(uint8_t ch);
void p_WS2812_refresh(void);
void p_WS2812_Pixel_RGB(uint32_t x, uint8_t ch, WS2812_RGB_t rgb_col);
void p_WS2812_All_RGB(uint8_t ch, WS2812_RGB_t rgb_col);
void p_WS2812_Shift_Left(uint8_t ch);
void p_WS2812_Shift_Right(uint8_t ch);
void p_WS2812_Rotate_Left(uint8_t ch);
void p_WS2812_Rotate_Right(uint8_t ch);
void p_WS2812_clearDMA(void);
void p_WS2812_clearAll(void);
void p_WS2812_clearBuff(void);
void p_WS2812_calcTimerBuf(uint8_t mode);
void p_WS2812_InitIO(void);
void p_WS2812_InitTIM(void);
void p_WS2812_InitDMA(void);
void p_WS2812_InitNVIC(void);
void p_WS2812_InitEXTI(void);
void p_WS2812_DMA_Start(void);



//--------------------------------------------------------------
// init aller WS2812-Ketten
// (alle LEDs ausschalten und messen der Laenge aller Ketten)
// Return_wert :
//  -> ERROR   , wenn laenge einer Kette nicht ok
//  -> SUCCESS , wenn laenge aller Ketten ok
// Laenge der Ketten steht in :
//    "WS2812_CHAIN_LEN.ch1" bis "WS2812_CHAIN_LEN.ch8"
//--------------------------------------------------------------
ErrorStatus UB_WS2812_Init(void)
{
  ErrorStatus ret_wert=SUCCESS;
  uint32_t n;
  uint8_t multi_ch=0;

  // init aller Variabeln
  ws2812_dma_status=0;
  ws2812_aktiv_channel=0;
  ws2812_maxanz=0;
  ws2812_len=0;
  ws2812_ch_changed=0;

  WS2812_CHAIN_LEN.ch1=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch2=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch3=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch4=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch5=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch6=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch7=WS2812_LED_MAX_ANZ;
  WS2812_CHAIN_LEN.ch8=WS2812_LED_MAX_ANZ;

  // Buffer loeschen
  p_WS2812_clearBuff();

  // init der LED Arrays aller Ketten
  multi_ch=0;
  #if WS2812_CH8_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH8[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x80;
  #endif
  #if WS2812_CH7_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH7[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x40;
  #endif
  #if WS2812_CH6_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH6[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x20;
  #endif
  #if WS2812_CH5_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH5[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x10;
  #endif
  #if WS2812_CH4_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH4[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x08;
  #endif
  #if WS2812_CH3_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH3[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x04;
  #endif
  #if WS2812_CH2_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH2[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x02;
  #endif
  #if WS2812_CH1_ENABLE>0
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH1[n]=WS2812_RGB_COL_OFF;
    }
    multi_ch|=0x01;
  #endif

  if(multi_ch==0) return(ERROR);

  // init vom GPIO
  p_WS2812_InitIO();
  // init vom Timer
  p_WS2812_InitTIM();
  // init vom EXTI
  p_WS2812_InitEXTI();
  // init vom NVIC
  p_WS2812_InitNVIC();
  // init vom DMA
  p_WS2812_InitDMA();

  // einmal DMA starten (ohne Signal)
  p_WS2812_clearDMA();

  // laengen Messung starten
  //ret_wert=UB_WS2812_Check_Len();

  // alle WS2812-Ketten loeschen
  p_WS2812_clearAll();

  return(ret_wert);
}


//--------------------------------------------------------------
// wandelt einen HSV-Farbwert in einen RGB-Farbwert um
// (Funktion von UlrichRadig.de)
//--------------------------------------------------------------
void UB_WS2812_RGB_2_HSV(WS2812_HSV_t hsv_col, WS2812_RGB_t *rgb_col)
{
  uint8_t diff;

  // Grenzwerte
  if(hsv_col.h>359) hsv_col.h=359;
  if(hsv_col.s>100) hsv_col.s=100;
  if(hsv_col.v>100) hsv_col.v=100;

  if(hsv_col.h < 61) {
    rgb_col->red = 255;
    rgb_col->green = (425 * hsv_col.h) / 100;
    rgb_col->blue = 0;
  }else if(hsv_col.h < 121){
    rgb_col->red = 255 - ((425 * (hsv_col.h-60))/100);
    rgb_col->green = 255;
    rgb_col->blue = 0;
  }else if(hsv_col.h < 181){
    rgb_col->red = 0;
    rgb_col->green = 255;
    rgb_col->blue = (425 * (hsv_col.h-120))/100;
  }else if(hsv_col.h < 241){
    rgb_col->red = 0;
    rgb_col->green = 255 - ((425 * (hsv_col.h-180))/100);
    rgb_col->blue = 255;
  }else if(hsv_col.h < 301){
    rgb_col->red = (425 * (hsv_col.h-240))/100;
    rgb_col->green = 0;
    rgb_col->blue = 255;
  }else {
    rgb_col->red = 255;
    rgb_col->green = 0;
    rgb_col->blue = 255 - ((425 * (hsv_col.h-300))/100);
  }

  hsv_col.s = 100 - hsv_col.s;
  diff = ((255 - rgb_col->red) * hsv_col.s)/100;
  rgb_col->red = rgb_col->red + diff;
  diff = ((255 - rgb_col->green) * hsv_col.s)/100;
  rgb_col->green = rgb_col->green + diff;
  diff = ((255 - rgb_col->blue) * hsv_col.s)/100;
  rgb_col->blue = rgb_col->blue + diff;

  rgb_col->red = (rgb_col->red * hsv_col.v)/100;
  rgb_col->green = (rgb_col->green * hsv_col.v)/100;
  rgb_col->blue = (rgb_col->blue * hsv_col.v)/100;
}


//--------------------------------------------------------------
// eine einzelbe LED auf eine Farbe setzen (RGB)
// x       : [0...WS2812_CHAIN_LEN.chx-1]
// y       : [0...7] 0=CH1...7=CH8
// rgb_col : Farbwert (in RGB)
//--------------------------------------------------------------
void UB_WS2812_Pixel_RGB(uint32_t x, uint8_t y, WS2812_RGB_t rgb_col)
{
  p_WS2812_Pixel_RGB(x,y+1,rgb_col);
}


//--------------------------------------------------------------
// alle LEDs der Kette(n) (je nach Maske) auf eine Farbe setzen (RGB)
// ch_maske : Maske für die LED-Kette [0...255] Bit0=CH1...Bit7=CH8
// rgb_col  : Farbwert (in RGB)
//--------------------------------------------------------------
void UB_WS2812_All_RGB(uint8_t ch_maske, WS2812_RGB_t rgb_col)
{
  // je nach Maske die Ketten waehlen
  if((ch_maske&0x01)!=0) p_WS2812_All_RGB(1,rgb_col);
  if((ch_maske&0x02)!=0) p_WS2812_All_RGB(2,rgb_col);
  if((ch_maske&0x04)!=0) p_WS2812_All_RGB(3,rgb_col);
  if((ch_maske&0x08)!=0) p_WS2812_All_RGB(4,rgb_col);
  if((ch_maske&0x10)!=0) p_WS2812_All_RGB(5,rgb_col);
  if((ch_maske&0x20)!=0) p_WS2812_All_RGB(6,rgb_col);
  if((ch_maske&0x40)!=0) p_WS2812_All_RGB(7,rgb_col);
  if((ch_maske&0x80)!=0) p_WS2812_All_RGB(8,rgb_col);
}


//--------------------------------------------------------------
// alle LEDs der Kette(n) (je nach Maske) eine position nach links schieben
// letzte LED wird ausgeschaltet
// ch_maske : Maske für die LED-Kette [0...255] Bit0=CH1...Bit7=CH8
//--------------------------------------------------------------
void UB_WS2812_Shift_Left(uint8_t ch_maske)
{
  // je nach Maske die Ketten waehlen
  if((ch_maske&0x01)!=0) p_WS2812_Shift_Left(1);
  if((ch_maske&0x02)!=0) p_WS2812_Shift_Left(2);
  if((ch_maske&0x04)!=0) p_WS2812_Shift_Left(3);
  if((ch_maske&0x08)!=0) p_WS2812_Shift_Left(4);
  if((ch_maske&0x10)!=0) p_WS2812_Shift_Left(5);
  if((ch_maske&0x20)!=0) p_WS2812_Shift_Left(6);
  if((ch_maske&0x40)!=0) p_WS2812_Shift_Left(7);
  if((ch_maske&0x80)!=0) p_WS2812_Shift_Left(8);
}


//--------------------------------------------------------------
// alle LEDs der Kette(n) (je nach Maske) eine position nach rechts schieben
// erste LED wird ausgeschaltet
// ch_maske : Maske für die LED-Kette [0...255] Bit0=CH1...Bit7=CH8
//--------------------------------------------------------------
void UB_WS2812_Shift_Right(uint8_t ch_maske)
{
  // je nach Maske die Ketten waehlen
  if((ch_maske&0x01)!=0) p_WS2812_Shift_Right(1);
  if((ch_maske&0x02)!=0) p_WS2812_Shift_Right(2);
  if((ch_maske&0x04)!=0) p_WS2812_Shift_Right(3);
  if((ch_maske&0x08)!=0) p_WS2812_Shift_Right(4);
  if((ch_maske&0x10)!=0) p_WS2812_Shift_Right(5);
  if((ch_maske&0x20)!=0) p_WS2812_Shift_Right(6);
  if((ch_maske&0x40)!=0) p_WS2812_Shift_Right(7);
  if((ch_maske&0x80)!=0) p_WS2812_Shift_Right(8);
}


//--------------------------------------------------------------
// alle LEDs der Kette(n) (je nach Maske) eine position nach links rotieren
// letzte LED bekommt den Farbwert der ersten LED
// ch_maske : Maske für die LED-Kette [0...255] Bit0=CH1...Bit7=CH8
//--------------------------------------------------------------
void UB_WS2812_Rotate_Left(uint8_t ch_maske)
{
  // je nach Maske die Ketten waehlen
  if((ch_maske&0x01)!=0) p_WS2812_Rotate_Left(1);
  if((ch_maske&0x02)!=0) p_WS2812_Rotate_Left(2);
  if((ch_maske&0x04)!=0) p_WS2812_Rotate_Left(3);
  if((ch_maske&0x08)!=0) p_WS2812_Rotate_Left(4);
  if((ch_maske&0x10)!=0) p_WS2812_Rotate_Left(5);
  if((ch_maske&0x20)!=0) p_WS2812_Rotate_Left(6);
  if((ch_maske&0x40)!=0) p_WS2812_Rotate_Left(7);
  if((ch_maske&0x80)!=0) p_WS2812_Rotate_Left(8);
}


//--------------------------------------------------------------
// alle LEDs der Kette(n) (je nach Maske) eine position nach rechts rotieren
// erste LED bekommt den Farbwert der letzten LED
// ch_maske : Maske für die LED-Kette [0...255] Bit0=CH1...Bit7=CH8
//--------------------------------------------------------------
void UB_WS2812_Rotate_Right(uint8_t ch_maske)
{
  // je nach Maske die Ketten waehlen
  if((ch_maske&0x01)!=0) p_WS2812_Rotate_Right(1);
  if((ch_maske&0x02)!=0) p_WS2812_Rotate_Right(2);
  if((ch_maske&0x04)!=0) p_WS2812_Rotate_Right(3);
  if((ch_maske&0x08)!=0) p_WS2812_Rotate_Right(4);
  if((ch_maske&0x10)!=0) p_WS2812_Rotate_Right(5);
  if((ch_maske&0x20)!=0) p_WS2812_Rotate_Right(6);
  if((ch_maske&0x40)!=0) p_WS2812_Rotate_Right(7);
  if((ch_maske&0x80)!=0) p_WS2812_Rotate_Right(8);
}


//--------------------------------------------------------------
// Zeichnet ein Ascii-Zeichen an eine Position
// mit Vorder- und Hintergrundfarbe (Font = 8 Pixel hoehe)
// x     : [0...WS2812_CHAIN_LEN.chx-1]
// ascii : Ascii-Zeichen (32 bis 128)
// vg    : Vordergrundfarbe (in RGB)
// bg    : Hintergrundfarbe (in RGB)
//--------------------------------------------------------------
void UB_WS2812_Char_RGB(uint32_t x, uint8_t ascii, WS2812_RGB_t vg, WS2812_RGB_t bg)
{
  uint16_t xn,yn,maske;
  const uint16_t *wert;

  ascii -= 32;
  wert=&Font_6x8.table[ascii * Font_6x8.height];

  // Font muss 8Pixel hoch sein
  if(Font_6x8.height!=8) return;

  for(yn = 0; yn < Font_6x8.height; yn++) {
    maske=0x80;
    for(xn = 0; xn < Font_6x8.width; xn++) {
      if((wert[yn] & maske) == 0x00) {
        // LED in Hintergrundfarbe zeichnen
        UB_WS2812_Pixel_RGB(x+xn,yn,bg);
      }
      else {
        // LED in Vordergrundfarbe zeichnen
        UB_WS2812_Pixel_RGB(x+xn,yn,vg);
      }
      maske=(maske>>1);
    }
  }
}


//--------------------------------------------------------------
// Zeichnet einen String an eine Position
// mit Vorder- und Hintergrundfarbe (Font = 8 Pixel hoehe)
// x   : [0...WS2812_CHAIN_LEN.chx-1]
// ptr : Pointer auf einen String
// vg  : Vordergrundfarbe (in RGB)
// bg  : Hintergrundfarbe (in RGB)
//--------------------------------------------------------------
void UB_WS2812_String_RGB(uint32_t x, char *ptr, WS2812_RGB_t vg, WS2812_RGB_t bg)
{
  uint32_t pos;

  pos=x;
  while (*ptr != 0) {
    UB_WS2812_Char_RGB(pos,*ptr,vg,bg);
    pos+=Font_6x8.width;
    ptr++;
  }
}


//--------------------------------------------------------------
// Refresh aller geänderten WS2812-Kette(n)
// (update aller LEDs)
// Die RGB-Farbwerte der LEDs muss im Array "WS2812_LED_BUF_CHx[n]" stehen
// n = [0...WS2812_CHAIN_LEN.chx-1]
//--------------------------------------------------------------
void UB_WS2812_RefreshAll(void)
{
  if(ws2812_ch_changed==0) return;

  // alle geaenderten Ketten refreshen
  if((ws2812_ch_changed&0x01)!=0) {
    p_WS2812_setChannel(1);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x02)!=0) {
    p_WS2812_setChannel(2);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x04)!=0) {
    p_WS2812_setChannel(3);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x08)!=0) {
    p_WS2812_setChannel(4);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x10)!=0) {
    p_WS2812_setChannel(5);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x20)!=0) {
    p_WS2812_setChannel(6);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x40)!=0) {
    p_WS2812_setChannel(7);
    p_WS2812_refresh();
  }
  if((ws2812_ch_changed&0x80)!=0) {
    p_WS2812_setChannel(8);
    p_WS2812_refresh();
  }

