janitz/uhrDesSandes/ub_lib/stm32_ub_ws2812_8ch.c
  // Ketten als refreshed markieren
  ws2812_ch_changed=0;
}


//--------------------------------------------------------------
// testet die Anzahl der LEDs in den WS2812-Ketten
// Return_wert :
//  -> ERROR   , wenn laenge einer Kette nicht ok
//  -> SUCCESS , wenn laenge aller Ketten ok
// Laenge der Ketten steht in :
//    "WS2812_CHAIN_LEN.ch1" bis "WS2812_CHAIN_LEN.ch8"
//--------------------------------------------------------------
ErrorStatus UB_WS2812_Check_Len(void)
{
  ErrorStatus ret_wert=SUCCESS;
  uint32_t n;

  // warte bis DMA-Transfer fertig
  while(ws2812_dma_status!=0);

  #if WS2812_CH1_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch1=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(1);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH1[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch1=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch1==0) {
      WS2812_CHAIN_LEN.ch1=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH2_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch2=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(2);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH2[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch2=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch2==0) {
      WS2812_CHAIN_LEN.ch2=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH3_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch3=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(3);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH3[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch3=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch3==0) {
      WS2812_CHAIN_LEN.ch3=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH4_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch4=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(4);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH4[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch4=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch4==0) {
      WS2812_CHAIN_LEN.ch4=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH5_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch5=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(5);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH5[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch5=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch5==0) {
      WS2812_CHAIN_LEN.ch5=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH6_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch6=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(6);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH6[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch6=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch6==0) {
      WS2812_CHAIN_LEN.ch6=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH7_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch7=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(7);

    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH7[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch7=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch7==0) {
      WS2812_CHAIN_LEN.ch7=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  #if WS2812_CH8_ENABLE>0
    // laenge auf max
    WS2812_CHAIN_LEN.ch8=WS2812_LED_MAX_ANZ;
    p_WS2812_setChannel(8);

