janitz/uhrDesSandes/ub_lib/stm32_ub_ws2812_8ch.c
    // alle LEDs ausschalten
    for(n=0;n<WS2812_LED_MAX_ANZ;n++) {
      WS2812_LED_BUF_CH8[n]=WS2812_RGB_COL_OFF;
    }
    // Timer Werte berrechnen (fuer Messung)
    p_WS2812_calcTimerBuf(1);

    // laenge zuruecksetzen
    ws2812_len=0;

    // DMA starten
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // buffer loeschen und DMA nochmal starten
    p_WS2812_clearBuff();
    p_WS2812_DMA_Start();
    while(ws2812_dma_status!=0);

    // gemessene laenge setzen
    WS2812_CHAIN_LEN.ch8=(ws2812_len/WS2812_BIT_PER_LED);
    if(WS2812_CHAIN_LEN.ch8==0) {
      WS2812_CHAIN_LEN.ch8=WS2812_LED_MAX_ANZ;
      ret_wert=ERROR;
    }
  #endif

  // laenge der nichtbenutzten Ketten auf 0 setzen
  if(WS2812_CH1_ENABLE==0) WS2812_CHAIN_LEN.ch1=0;
  if(WS2812_CH2_ENABLE==0) WS2812_CHAIN_LEN.ch2=0;
  if(WS2812_CH3_ENABLE==0) WS2812_CHAIN_LEN.ch3=0;
  if(WS2812_CH4_ENABLE==0) WS2812_CHAIN_LEN.ch4=0;
  if(WS2812_CH5_ENABLE==0) WS2812_CHAIN_LEN.ch5=0;
  if(WS2812_CH6_ENABLE==0) WS2812_CHAIN_LEN.ch6=0;
  if(WS2812_CH7_ENABLE==0) WS2812_CHAIN_LEN.ch7=0;
  if(WS2812_CH8_ENABLE==0) WS2812_CHAIN_LEN.ch8=0;  

  // messung deaktivieren
  ws2812_len=1;

  return(ret_wert);
}


//--------------------------------------------------------------
// interne Funktion
// aktiviert eine einzelne WS2812 Kette
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_setChannel(uint8_t ch)
{
  ws2812_aktiv_channel=0;

  #if WS2812_CH1_ENABLE>0
    if(ch==1) {
      ws2812_aktiv_channel=1;
      ws2812_ptr=&WS2812_LED_BUF_CH1[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch1;      
    }
  #endif
  #if WS2812_CH2_ENABLE>0
    if(ch==2) {
      ws2812_aktiv_channel=2;
      ws2812_ptr=&WS2812_LED_BUF_CH2[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch2;
    }
  #endif
  #if WS2812_CH3_ENABLE>0
    if(ch==3) {
      ws2812_aktiv_channel=3;
      ws2812_ptr=&WS2812_LED_BUF_CH3[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch3;
    }
  #endif
  #if WS2812_CH4_ENABLE>0
    if(ch==4) {
      ws2812_aktiv_channel=4;
      ws2812_ptr=&WS2812_LED_BUF_CH4[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch4;
    }
  #endif
  #if WS2812_CH5_ENABLE>0
    if(ch==5) {
      ws2812_aktiv_channel=5;
      ws2812_ptr=&WS2812_LED_BUF_CH5[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch5;
    }
  #endif
  #if WS2812_CH6_ENABLE>0
    if(ch==6) {
      ws2812_aktiv_channel=6;
      ws2812_ptr=&WS2812_LED_BUF_CH6[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch6;
    }
  #endif
  #if WS2812_CH7_ENABLE>0
    if(ch==7) {
      ws2812_aktiv_channel=7;
      ws2812_ptr=&WS2812_LED_BUF_CH7[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch7;
    }
  #endif
  #if WS2812_CH8_ENABLE>0
    if(ch==8) {
      ws2812_aktiv_channel=8;
      ws2812_ptr=&WS2812_LED_BUF_CH8[0];
      ws2812_maxanz=WS2812_CHAIN_LEN.ch8;
    }
  #endif
}


//--------------------------------------------------------------
// interne Funktion
// refresh der aktiven WS2812 Kette
//--------------------------------------------------------------
void p_WS2812_refresh(void)
{
  if(ws2812_aktiv_channel==0) return;

  // warte bis DMA-Transfer fertig
  while(ws2812_dma_status!=0);

  // Timer Werte berrechnen (normal mode)
  p_WS2812_calcTimerBuf(0);

  // DMA starten
  p_WS2812_DMA_Start();  
}


//--------------------------------------------------------------
// interne Funktion
// setzt eine einzelne LED eines Kanals auf eine Farbe
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_Pixel_RGB(uint32_t x, uint8_t ch, WS2812_RGB_t rgb_col)
{
  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  if(x<ws2812_maxanz) {
    ws2812_ptr[x]=rgb_col;
    // kette als geaendert markieren
    ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
  }
}


//--------------------------------------------------------------
// interne Funktion
// setzt alle LEDs vom Kanal auf eine Farbe
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_All_RGB(uint8_t ch, WS2812_RGB_t rgb_col)
{
  uint32_t n;

  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  for(n=0;n<ws2812_maxanz;n++) {
    ws2812_ptr[n]=rgb_col;
  }
  // kette als geaendert markieren
  ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
}


//--------------------------------------------------------------
// interne Funktion
// schiebe alle LEDs vom Kanal nach links
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_Shift_Left(uint8_t ch)
{
  uint32_t n;

  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  if(ws2812_maxanz>1) {
    for(n=1;n<ws2812_maxanz;n++) {
      ws2812_ptr[n-1]=ws2812_ptr[n];
    }
    ws2812_ptr[n-1]=WS2812_RGB_COL_OFF;
 
    // kette als geaendert markieren
    ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
  }
}


//--------------------------------------------------------------
// interne Funktion
// schiebe alle LEDs vom Kanal nach rechts
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_Shift_Right(uint8_t ch)
{
  uint32_t n;

  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  if(ws2812_maxanz>1) {
    for(n=ws2812_maxanz-1;n>0;n--) {
      ws2812_ptr[n]=ws2812_ptr[n-1];
    }
    ws2812_ptr[n]=WS2812_RGB_COL_OFF;

    // kette als geaendert markieren
    ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
  }
}


//--------------------------------------------------------------
// interne Funktion
// rotiert alle LEDs vom Kanal nach links
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_Rotate_Left(uint8_t ch)
{
  uint32_t n;
  WS2812_RGB_t d;

  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  if(ws2812_maxanz>1) {
    d=ws2812_ptr[0];
    for(n=1;n<ws2812_maxanz;n++) {
      ws2812_ptr[n-1]=ws2812_ptr[n];
    }
    ws2812_ptr[n-1]=d;

    // kette als geaendert markieren
    ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
  }
}


//--------------------------------------------------------------
// interne Funktion
// rotiert alle LEDs vom Kanal nach rechts
// ch : [1...8]
//--------------------------------------------------------------
void p_WS2812_Rotate_Right(uint8_t ch)
{
  uint32_t n;
  WS2812_RGB_t d;

  p_WS2812_setChannel(ch);

  if(ws2812_aktiv_channel==0) return;

  if(ws2812_maxanz>1) {
    d=ws2812_ptr[ws2812_maxanz-1];
    for(n=ws2812_maxanz-1;n>0;n--) {
      ws2812_ptr[n]=ws2812_ptr[n-1];
    }
    ws2812_ptr[n]=d;

    // kette als geaendert markieren
    ws2812_ch_changed|=(1<<(ws2812_aktiv_channel-1));
  }
}


//--------------------------------------------------------------
// interne Funktion
// startet einmal alle DMA Kanaele
//--------------------------------------------------------------
void p_WS2812_clearDMA(void)
{
  // loescht den Buffer
  p_WS2812_clearBuff();

  //-------------------------
  // einmal DMA starten
  // (ohne Signal, Dauer LoPegel)
  //-------------------------
  #if WS2812_CH8_ENABLE>0
    // auf Kanal 8 schalten
    p_WS2812_setChannel(8);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH7_ENABLE>0
    // auf Kanal 7 schalten
    p_WS2812_setChannel(7);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH6_ENABLE>0
    // auf Kanal 6 schalten
    p_WS2812_setChannel(6);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH5_ENABLE>0
    // auf Kanal 5 schalten
    p_WS2812_setChannel(5);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH4_ENABLE>0
    // auf Kanal 4 schalten
    p_WS2812_setChannel(4);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH3_ENABLE>0
    // auf Kanal 3 schalten
    p_WS2812_setChannel(3);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH2_ENABLE>0
    // auf Kanal 2 schalten
    p_WS2812_setChannel(2);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
  #if WS2812_CH1_ENABLE>0
    // auf Kanal 1 schalten
    p_WS2812_setChannel(1);
    // warte bis DMA-Transfer fertig
    while(ws2812_dma_status!=0);
    // DMA starten
    p_WS2812_DMA_Start();
  #endif
}


//--------------------------------------------------------------
// interne Funktion
// loescht alle WS2812-Ketten
//--------------------------------------------------------------
void p_WS2812_clearAll(void)
{
  //-------------------------
  // alle LEDs ausschalten
  //-------------------------
  UB_WS2812_All_RGB(0xFF, WS2812_RGB_COL_OFF);
  UB_WS2812_RefreshAll();
}


//--------------------------------------------------------------
// interne Funktion
// Buffer loeschen
//--------------------------------------------------------------
void p_WS2812_clearBuff(void)
{
  uint32_t n;

  // init vom Timer Array
  for(n=0;n<WS2812_TIMER_BUF_LEN;n++) {
    WS2812_TIMER_BUF[n]=0; // 0 => kein Signal
  }
}


//--------------------------------------------------------------
// interne Funktion
// errechnet aus den RGB-Farbwerten der aktiven LEDs
// die notwendigen PWM-Werte fuer die Datenleitung
// mode : 0=normal, 1=test der laenge
//--------------------------------------------------------------
void p_WS2812_calcTimerBuf(uint8_t mode)
{
  uint32_t n;
  uint32_t pos;
  WS2812_RGB_t led;

  if(ws2812_aktiv_channel==0) return;

